results/run-ai-original.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: ai/ai-scenario-original.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/2m00.0s

running (0m02.0s), 02/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 02/20 VUs  0m02.0s/2m00.0s

running (0m03.0s), 02/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 02/20 VUs  0m03.0s/2m00.0s

running (0m04.0s), 03/20 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 03/20 VUs  0m04.0s/2m00.0s

running (0m05.0s), 04/20 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 04/20 VUs  0m05.0s/2m00.0s

running (0m06.0s), 04/20 VUs, 3 complete and 0 interrupted iterations
default   [   5% ] 04/20 VUs  0m06.0s/2m00.0s

running (0m07.0s), 05/20 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 05/20 VUs  0m07.0s/2m00.0s

running (0m08.0s), 06/20 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 06/20 VUs  0m08.0s/2m00.0s

running (0m09.0s), 06/20 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 06/20 VUs  0m09.0s/2m00.0s

running (0m10.0s), 07/20 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 07/20 VUs  0m10.0s/2m00.0s

running (0m11.0s), 07/20 VUs, 10 complete and 0 interrupted iterations
default   [   9% ] 07/20 VUs  0m11.0s/2m00.0s

running (0m12.0s), 08/20 VUs, 13 complete and 0 interrupted iterations
default   [  10% ] 08/20 VUs  0m12.0s/2m00.0s

running (0m13.0s), 09/20 VUs, 16 complete and 0 interrupted iterations
default   [  11% ] 09/20 VUs  0m13.0s/2m00.0s

running (0m14.0s), 09/20 VUs, 17 complete and 0 interrupted iterations
default   [  12% ] 09/20 VUs  0m14.0s/2m00.0s

running (0m15.0s), 10/20 VUs, 22 complete and 0 interrupted iterations
default   [  12% ] 10/20 VUs  0m15.0s/2m00.0s

running (0m16.0s), 11/20 VUs, 25 complete and 0 interrupted iterations
default   [  13% ] 11/20 VUs  0m16.0s/2m00.0s

running (0m17.0s), 11/20 VUs, 31 complete and 0 interrupted iterations
default   [  14% ] 11/20 VUs  0m17.0s/2m00.0s

running (0m18.0s), 12/20 VUs, 32 complete and 0 interrupted iterations
default   [  15% ] 12/20 VUs  0m18.0s/2m00.0s

running (0m19.0s), 13/20 VUs, 35 complete and 0 interrupted iterations
default   [  16% ] 13/20 VUs  0m19.0s/2m00.0s

running (0m20.0s), 13/20 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 13/20 VUs  0m20.0s/2m00.0s

running (0m21.0s), 14/20 VUs, 45 complete and 0 interrupted iterations
default   [  17% ] 14/20 VUs  0m21.0s/2m00.0s

running (0m22.0s), 14/20 VUs, 48 complete and 0 interrupted iterations
default   [  18% ] 14/20 VUs  0m22.0s/2m00.0s

running (0m23.0s), 15/20 VUs, 55 complete and 0 interrupted iterations
default   [  19% ] 15/20 VUs  0m23.0s/2m00.0s

running (0m24.0s), 16/20 VUs, 60 complete and 0 interrupted iterations
default   [  20% ] 16/20 VUs  0m24.0s/2m00.0s

running (0m25.0s), 16/20 VUs, 67 complete and 0 interrupted iterations
default   [  21% ] 16/20 VUs  0m25.0s/2m00.0s

running (0m26.0s), 17/20 VUs, 73 complete and 0 interrupted iterations
default   [  22% ] 17/20 VUs  0m26.0s/2m00.0s

running (0m27.0s), 18/20 VUs, 78 complete and 0 interrupted iterations
default   [  22% ] 18/20 VUs  0m27.0s/2m00.0s

running (0m28.0s), 18/20 VUs, 86 complete and 0 interrupted iterations
default   [  23% ] 18/20 VUs  0m28.0s/2m00.0s

running (0m29.0s), 19/20 VUs, 93 complete and 0 interrupted iterations
default   [  24% ] 19/20 VUs  0m29.0s/2m00.0s

running (0m30.0s), 19/20 VUs, 100 complete and 0 interrupted iterations
default   [  25% ] 19/20 VUs  0m30.0s/2m00.0s

running (0m31.0s), 20/20 VUs, 106 complete and 0 interrupted iterations
default   [  26% ] 20/20 VUs  0m31.0s/2m00.0s

running (0m32.0s), 20/20 VUs, 111 complete and 0 interrupted iterations
default   [  27% ] 20/20 VUs  0m32.0s/2m00.0s

running (0m33.0s), 20/20 VUs, 119 complete and 0 interrupted iterations
default   [  27% ] 20/20 VUs  0m33.0s/2m00.0s

running (0m34.0s), 20/20 VUs, 126 complete and 0 interrupted iterations
default   [  28% ] 20/20 VUs  0m34.0s/2m00.0s

running (0m35.0s), 20/20 VUs, 133 complete and 0 interrupted iterations
default   [  29% ] 20/20 VUs  0m35.0s/2m00.0s

running (0m36.0s), 20/20 VUs, 141 complete and 0 interrupted iterations
default   [  30% ] 20/20 VUs  0m36.0s/2m00.0s

running (0m37.0s), 20/20 VUs, 151 complete and 0 interrupted iterations
default   [  31% ] 20/20 VUs  0m37.0s/2m00.0s

running (0m38.0s), 20/20 VUs, 159 complete and 0 interrupted iterations
default   [  32% ] 20/20 VUs  0m38.0s/2m00.0s

running (0m39.0s), 20/20 VUs, 167 complete and 0 interrupted iterations
default   [  32% ] 20/20 VUs  0m39.0s/2m00.0s

running (0m40.0s), 20/20 VUs, 174 complete and 0 interrupted iterations
default   [  33% ] 20/20 VUs  0m40.0s/2m00.0s

running (0m41.0s), 20/20 VUs, 182 complete and 0 interrupted iterations
default   [  34% ] 20/20 VUs  0m41.0s/2m00.0s

running (0m42.0s), 20/20 VUs, 191 complete and 0 interrupted iterations
default   [  35% ] 20/20 VUs  0m42.0s/2m00.0s

running (0m43.0s), 20/20 VUs, 201 complete and 0 interrupted iterations
default   [  36% ] 20/20 VUs  0m43.0s/2m00.0s

running (0m44.0s), 20/20 VUs, 208 complete and 0 interrupted iterations
default   [  37% ] 20/20 VUs  0m44.0s/2m00.0s

running (0m45.0s), 20/20 VUs, 214 complete and 0 interrupted iterations
default   [  37% ] 20/20 VUs  0m45.0s/2m00.0s

running (0m46.0s), 20/20 VUs, 223 complete and 0 interrupted iterations
default   [  38% ] 20/20 VUs  0m46.0s/2m00.0s

running (0m47.0s), 20/20 VUs, 231 complete and 0 interrupted iterations
default   [  39% ] 20/20 VUs  0m47.0s/2m00.0s

running (0m48.0s), 20/20 VUs, 232 complete and 0 interrupted iterations
default   [  40% ] 20/20 VUs  0m48.0s/2m00.0s

running (0m49.0s), 20/20 VUs, 244 complete and 0 interrupted iterations
default   [  41% ] 20/20 VUs  0m49.0s/2m00.0s

running (0m50.0s), 20/20 VUs, 251 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  0m50.0s/2m00.0s

running (0m51.0s), 20/20 VUs, 261 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  0m51.0s/2m00.0s

running (0m52.0s), 20/20 VUs, 271 complete and 0 interrupted iterations
default   [  43% ] 20/20 VUs  0m52.0s/2m00.0s

running (0m53.0s), 20/20 VUs, 273 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  0m53.0s/2m00.0s

running (0m54.0s), 20/20 VUs, 281 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  0m54.0s/2m00.0s

running (0m55.0s), 20/20 VUs, 291 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m55.0s/2m00.0s

running (0m56.0s), 20/20 VUs, 294 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m56.0s/2m00.0s

running (0m57.0s), 20/20 VUs, 304 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m57.0s/2m00.0s

running (0m58.0s), 20/20 VUs, 311 complete and 0 interrupted iterations
default   [  48% ] 20/20 VUs  0m58.0s/2m00.0s

running (0m59.0s), 20/20 VUs, 321 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  0m59.0s/2m00.0s

running (1m00.0s), 20/20 VUs, 331 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  1m00.0s/2m00.0s

running (1m01.0s), 20/20 VUs, 334 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  1m01.0s/2m00.0s

running (1m02.0s), 20/20 VUs, 345 complete and 0 interrupted iterations
default   [  52% ] 20/20 VUs  1m02.0s/2m00.0s

running (1m03.0s), 20/20 VUs, 352 complete and 0 interrupted iterations
default   [  52% ] 20/20 VUs  1m03.0s/2m00.0s

running (1m04.0s), 20/20 VUs, 361 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  1m04.0s/2m00.0s

running (1m05.0s), 20/20 VUs, 371 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  1m05.0s/2m00.0s

running (1m06.0s), 20/20 VUs, 374 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  1m06.0s/2m00.0s

running (1m07.0s), 20/20 VUs, 385 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  1m07.0s/2m00.0s

running (1m08.0s), 20/20 VUs, 392 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  1m08.0s/2m00.0s

running (1m09.0s), 20/20 VUs, 393 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  1m09.0s/2m00.0s

running (1m10.0s), 20/20 VUs, 403 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  1m10.0s/2m00.0s

running (1m11.0s), 20/20 VUs, 412 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  1m11.0s/2m00.0s

running (1m12.0s), 20/20 VUs, 414 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  1m12.0s/2m00.0s

running (1m13.0s), 20/20 VUs, 431 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  1m13.0s/2m00.0s

running (1m14.0s), 20/20 VUs, 433 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  1m14.0s/2m00.0s

running (1m15.0s), 20/20 VUs, 445 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  1m15.0s/2m00.0s

running (1m16.0s), 20/20 VUs, 452 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  1m16.0s/2m00.0s

running (1m17.0s), 20/20 VUs, 454 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  1m17.0s/2m00.0s

running (1m18.0s), 20/20 VUs, 469 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  1m18.0s/2m00.0s

running (1m19.0s), 20/20 VUs, 474 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  1m19.0s/2m00.0s

running (1m20.0s), 20/20 VUs, 485 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  1m20.0s/2m00.0s

running (1m21.0s), 20/20 VUs, 492 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  1m21.0s/2m00.0s

running (1m22.0s), 20/20 VUs, 494 complete and 0 interrupted iterations
default   [  68% ] 20/20 VUs  1m22.0s/2m00.0s

running (1m23.0s), 20/20 VUs, 504 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  1m23.0s/2m00.0s

running (1m24.0s), 20/20 VUs, 512 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  1m24.0s/2m00.0s

running (1m25.0s), 20/20 VUs, 514 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  1m25.0s/2m00.0s

running (1m26.0s), 20/20 VUs, 527 complete and 0 interrupted iterations
default   [  72% ] 20/20 VUs  1m26.0s/2m00.0s

running (1m27.0s), 20/20 VUs, 533 complete and 0 interrupted iterations
default   [  72% ] 20/20 VUs  1m27.0s/2m00.0s

running (1m28.0s), 20/20 VUs, 544 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  1m28.0s/2m00.0s

running (1m29.0s), 20/20 VUs, 549 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  1m29.0s/2m00.0s

running (1m30.0s), 20/20 VUs, 554 complete and 0 interrupted iterations
default   [  75% ] 20/20 VUs  1m30.0s/2m00.0s

running (1m31.0s), 20/20 VUs, 564 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  1m31.0s/2m00.0s

running (1m32.0s), 20/20 VUs, 572 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  1m32.0s/2m00.0s

running (1m33.0s), 20/20 VUs, 574 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  1m33.0s/2m00.0s

running (1m34.0s), 18/20 VUs, 589 complete and 0 interrupted iterations
default   [  78% ] 18/20 VUs  1m34.0s/2m00.0s

running (1m35.0s), 18/20 VUs, 594 complete and 0 interrupted iterations
default   [  79% ] 18/20 VUs  1m35.0s/2m00.0s

running (1m36.0s), 18/20 VUs, 598 complete and 0 interrupted iterations
default   [  80% ] 18/20 VUs  1m36.0s/2m00.0s

running (1m37.0s), 17/20 VUs, 606 complete and 0 interrupted iterations
default   [  81% ] 17/20 VUs  1m37.0s/2m00.0s

running (1m38.0s), 17/20 VUs, 612 complete and 0 interrupted iterations
default   [  82% ] 17/20 VUs  1m38.0s/2m00.0s

running (1m39.0s), 16/20 VUs, 622 complete and 0 interrupted iterations
default   [  82% ] 16/20 VUs  1m39.0s/2m00.0s

running (1m40.0s), 15/20 VUs, 629 complete and 0 interrupted iterations
default   [  83% ] 15/20 VUs  1m40.0s/2m00.0s

running (1m41.0s), 15/20 VUs, 630 complete and 0 interrupted iterations
default   [  84% ] 15/20 VUs  1m41.0s/2m00.0s

running (1m42.0s), 13/20 VUs, 641 complete and 0 interrupted iterations
default   [  85% ] 13/20 VUs  1m42.0s/2m00.0s

running (1m43.0s), 13/20 VUs, 644 complete and 0 interrupted iterations
default   [  86% ] 13/20 VUs  1m43.0s/2m00.0s

running (1m44.0s), 12/20 VUs, 652 complete and 0 interrupted iterations
default   [  87% ] 12/20 VUs  1m44.0s/2m00.0s

running (1m45.0s), 11/20 VUs, 657 complete and 0 interrupted iterations
default   [  87% ] 11/20 VUs  1m45.0s/2m00.0s

running (1m46.0s), 11/20 VUs, 658 complete and 0 interrupted iterations
default   [  88% ] 11/20 VUs  1m46.0s/2m00.0s

running (1m47.0s), 10/20 VUs, 666 complete and 0 interrupted iterations
default   [  89% ] 10/20 VUs  1m47.0s/2m00.0s

running (1m48.0s), 10/20 VUs, 668 complete and 0 interrupted iterations
default   [  90% ] 10/20 VUs  1m48.0s/2m00.0s

running (1m49.0s), 08/20 VUs, 676 complete and 0 interrupted iterations
default   [  91% ] 08/20 VUs  1m49.0s/2m00.0s

running (1m50.0s), 08/20 VUs, 678 complete and 0 interrupted iterations
default   [  92% ] 08/20 VUs  1m50.0s/2m00.0s

running (1m51.0s), 08/20 VUs, 679 complete and 0 interrupted iterations
default   [  92% ] 08/20 VUs  1m51.0s/2m00.0s

running (1m52.0s), 07/20 VUs, 684 complete and 0 interrupted iterations
default   [  93% ] 07/20 VUs  1m52.0s/2m00.0s

running (1m53.0s), 06/20 VUs, 686 complete and 0 interrupted iterations
default   [  94% ] 06/20 VUs  1m53.0s/2m00.0s

running (1m54.0s), 05/20 VUs, 691 complete and 0 interrupted iterations
default   [  95% ] 05/20 VUs  1m54.0s/2m00.0s

running (1m55.0s), 05/20 VUs, 692 complete and 0 interrupted iterations
default   [  96% ] 05/20 VUs  1m55.0s/2m00.0s

running (1m56.0s), 05/20 VUs, 693 complete and 0 interrupted iterations
default   [  97% ] 05/20 VUs  1m56.0s/2m00.0s

running (1m57.0s), 03/20 VUs, 696 complete and 0 interrupted iterations
default   [  97% ] 03/20 VUs  1m57.0s/2m00.0s

running (1m58.0s), 02/20 VUs, 697 complete and 0 interrupted iterations
default   [  98% ] 02/20 VUs  1m58.0s/2m00.0s

running (1m59.0s), 02/20 VUs, 699 complete and 0 interrupted iterations
default   [  99% ] 02/20 VUs  1m59.0s/2m00.0s

running (2m00.0s), 02/20 VUs, 699 complete and 0 interrupted iterations
default   [ 100% ] 02/20 VUs  2m00.0s/2m00.0s

running (2m01.0s), 02/20 VUs, 699 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/20 VUs  2m0s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.95' rate=33.33%

    http_req_duration
    ✓ 'p(95)<500' p(95)=479.32ms

    http_req_failed
    ✗ 'rate<0.01' rate=33.33%


  █ TOTAL RESULTS 

    checks_total.......: 2103   17.279448/s
    checks_succeeded...: 33.33% 701 out of 2103
    checks_failed......: 66.66% 1402 out of 2103

    ✗ nevtrelt amjilttai
      ↳  0% — ✓ 0 / ✗ 701
    ✗ Welcome tekst baina
      ↳  0% — ✓ 0 / ✗ 701
    ✓ hailt amjilttai

    HTTP
    http_req_duration..............: avg=201.29ms min=71.93ms med=124.19ms max=1.32s p(90)=370.72ms p(95)=479.32ms
      { expected_response:true }...: avg=232.22ms min=74.5ms  med=256.41ms max=1.32s p(90)=409.32ms p(95)=502.02ms
    http_req_failed................: 33.33% 701 out of 2103
    http_reqs......................: 2103   17.279448/s

    EXECUTION
    iteration_duration.............: avg=2.63s    min=2.4s    med=2.49s    max=4.76s p(90)=3.09s    p(95)=3.23s   
    iterations.....................: 701    5.759816/s
    vus............................: 2      min=1           max=20
    vus_max........................: 20     min=20          max=20

    NETWORK
    data_received..................: 2.6 MB 22 kB/s
    data_sent......................: 202 kB 1.7 kB/s



running (2m01.7s), 00/20 VUs, 701 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  2m0s
time="2026-09-09T15:22:36+08:00" level=error msg="thresholds on metrics 'checks, http_req_failed' have been crossed"